In [1]:
import sqlite3

In [2]:
db = sqlite3.connect("companydatabase.db")

In [3]:
cursor = db.cursor()

In [5]:
cursor.execute('CREATE TABLE company1(ID int, Name text, Age int, Address text, Salary real)')

In [7]:
# Insert a row of data only by providing values
cursor.execute("INSERT INTO company1 VALUES (1, 'Jhon', 32, 'Bangalore', 100000.00)")
cursor.execute("INSERT INTO company1 VALUES (2, 'Jhon', 32, 'Bangalore', 100000.00)")

In [8]:
data = cursor.execute("select * from company1")

In [9]:
data

In [10]:
type(data)

sqlite3.Cursor

In [11]:
for d in data:
    print(d)

(1, 'Jhon', 32, 'Bangalore', 100000.0)
(2, 'Jhon', 32, 'Bangalore', 100000.0)

In [13]:
# Insert a row of data
cursor.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (3, 'Venkat', 42, 'Chennai', 400000.00)")

cursor.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (4, 'Raju', 31, 'Madurai', 400000.00)")

In [14]:
data = cursor.execute("select * from company1")

In [15]:
for d in data:
    print(d)

(1, 'Jhon', 32, 'Bangalore', 100000.0)
(2, 'Jhon', 32, 'Bangalore', 100000.0)
(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)

In [16]:
# Save (commit) the changes
db.commit()

In [17]:
db.close()

In [18]:
mydb = sqlite3.connect('companydatabase.db')

In [19]:
c = mydb.cursor()

In [20]:
data = c.execute('select * from company1 where Salary > 100000')

In [21]:
for i in data:
    print(i)

(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)

In [22]:
data = c.execute('select * from company1 where Salary > 90000')
for i in data:
    print(i)

(1, 'Jhon', 32, 'Bangalore', 100000.0)
(2, 'Jhon', 32, 'Bangalore', 100000.0)
(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)

In [27]:
data = c.execute("select Name from company1 where Address = 'Bangalore'")
for i in data:
    print(i)

('Jhon',)
('Jhon',)

In [29]:
data=c.execute("select ID, Name from company1 order by Age")
for x in data:
    print(x)

(4, 'Raju')
(1, 'Jhon')
(2, 'Jhon')
(3, 'Venkat')

In [30]:
data=c.execute("select ID, Name from company1 order by Age desc")
for x in data:
    print(x)

(3, 'Venkat')
(1, 'Jhon')
(2, 'Jhon')
(4, 'Raju')

In [31]:
# importing sqlite
import sqlite3

#connecting with the database.
db = sqlite3.connect("food_database.db")
c = db.cursor()

# Create table to store food name and their colories
c.execute('CREATE TABLE food(Name text, Calories int)') 

# Insert a row of data
c.execute("INSERT INTO food VALUES ('Mango', 60)")
c.execute("INSERT INTO food VALUES ('Samosa',262)")

In [32]:
data=c.execute("SELECT * FROM food")
for i in data:
    print(i)

('Mango', 60)
('Samosa', 262)

In [33]:
## Its recommended to use this DROP command
c.execute("DROP table IF EXISTS food")

In [34]:
c.execute("INSERT INTO food VALUES ('Mango', 60)")

OperationalError: no such table: food